simulations/unorganized/diamond_test/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    line1 // pi/4
    {
        type    lineCell;
        axis    xyz;
        start   (0.35355 0.35355 0);
        end     (3.53553 3.53553 0);
    }
    line2 // pi/2
    {
        type    lineCell;
        axis    xyz;
        start   (0 0.5 0);
        end     (0 3.5 0);
    }
    line3 // 3pi/4
    {
        type    lineCell;
        axis    xyz;
        start   (-0.35355 0.35355 0);
        end     (-3.53553 3.53553 0);
    }
    line4 // recirculation
    {
        type    lineCell;
        axis    xyz;
        start   (0.5 0 0);
        end     (5 0 0);
    }

);

fields          ( p U );


// ************************************************************************* //
